Cosmic-Bee/PSoC6_Bluetooth_A2DP_Sink/source/sink_bluetooth/a2dp_sink.c
/******************************************************************************
* File Name:   a2dp_source.c
*
* Description: Source file for A2DP source task.
*
*******************************************************************************
* Copyright 2023, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

/******************************************************************************
 * Includes
 *****************************************************************************/

#ifdef  WICED_BT_TRACE_ENABLE
#include "wiced_bt_trace.h"
#endif
#include "../sink_bluetooth/a2dp_sink.h"
#include "cyhal_gpio.h"
#include "cybsp.h"
#include "i2s_audio.h"

/******************************************************************************
 * Macros
 *****************************************************************************/

#define A2DP_SINK_NVRAM_ID                0
#define WICED_HS_EIR_BUF_MAX_SIZE           (264U)

#define MSBC_STATIC_MEM_SIZE            (1920U) /* Bytes */
#define MSBC_SCRATCH_MEM_SIZE           (2048U) /* Bytes */

#define SBC_SYNC_BYTE                   (0x9C)

/* Channel Mode Values */
#define CH_MODE_MONO                    (0)
#define CH_MODE_DUAL                    (1)
#define CH_MODE_STEREO                  (2)
#define CH_MODE_JOINT_STEREO            (3)

/* Audio Sample Rate in Hz*/
#define AUDIO_SAMPLE_RATE_48kHz            (48000U)
#define AUDIO_SAMPLE_RATE_44_1kHz          (44100U)
#define AUDIO_SAMPLE_RATE_32kHz            (32000U)
#define AUDIO_SAMPLE_RATE_16kHz            (16000U)

/* ***************************************************************************
 * Static variables
 * **************************************************************************/

uint8_t pincode[4] = { 0x30, 0x30, 0x30, 0x30 };
extern const uint8_t a2dp_sink_sdp_db[A2DP_SINK_SDP_DB_SIZE];
extern const wiced_bt_cfg_settings_t a2dp_sink_cfg_settings;
extern wiced_bt_device_address_t bt_device_address;
static SINT32 staticMem[MSBC_STATIC_MEM_SIZE / sizeof (SINT32)];
static SINT32 scratchMem[MSBC_SCRATCH_MEM_SIZE / sizeof (SINT32)];
static int              PcmBytesPerFrame;
static SBC_DEC_PARAMS   strDecParams = { 0 };
static unsigned long    audio_frames_to_write = 0;
long                    audio_frames_written = 0;
uint16_t                sample_rate = 0;
tAV_APP_CB              av_app_cb;
wiced_bt_device_link_keys_t nv_key_ram;

/* Stack configuration */
extern const uint8_t                        a2dp_sink_sdp_db[A2DP_SINK_SDP_DB_SIZE];
extern const wiced_bt_cfg_settings_t        a2dp_sink_cfg_settings;
extern wiced_bt_a2dp_config_data_t          bt_audio_config;

/******************************************************************************
 *                          Function Definitions
 ******************************************************************************/

/* ****************************************************************************
 * Function Name: get_control_event_name
 *******************************************************************************
 * Summary:
 *          Gives the string equivalent for the Event type
 *
 * Parameters:
 *          event - Control event called back
 *
 * Return:
 *          Pointer to String containing the Event Type
 *
 * ***************************************************************************/
static const char *get_control_event_name(wiced_bt_a2dp_sink_event_t event)
{
    switch((int)event)
    {
    CASE_RETURN_STR(WICED_BT_A2DP_SINK_CONNECT_EVT)
    CASE_RETURN_STR(WICED_BT_A2DP_SINK_DISCONNECT_EVT)
    CASE_RETURN_STR(WICED_BT_A2DP_SINK_START_IND_EVT)
    CASE_RETURN_STR(WICED_BT_A2DP_SINK_START_CFM_EVT)
    CASE_RETURN_STR(WICED_BT_A2DP_SINK_SUSPEND_EVT)
    CASE_RETURN_STR(WICED_BT_A2DP_SINK_CODEC_CONFIG_EVT)
    }

    return NULL;
}

/* ****************************************************************************
 * Function Name: get_state_name
 ******************************************************************************
 * Summary:
 *          Gives the string equivalent for the State
 *
 * Parameters:
 *          state - AV State
 *
 * Return:
 *          Pointer to String containing the State Name
 *
 * ***************************************************************************/
static const char *get_state_name(AV_STATE state)
{
    switch((int)state)
    {
    CASE_RETURN_STR(AV_STATE_IDLE)
    CASE_RETURN_STR(AV_STATE_CONFIGURED)
    CASE_RETURN_STR(AV_STATE_CONNECTED)
    CASE_RETURN_STR(AV_STATE_STARTED)
    }

