Cosmic-Bee/PSoC6_Bluetooth_A2DP_Sink/source/sink_bluetooth/a2dp_sink.c
    return NULL;
}

/* ****************************************************************************
 * Function Name: a2dp_sink_get_frame_len
 ******************************************************************************
 * Summary:
 *          Calculates the frame length based on the CODEC parameters chosen
 *
 * Parameters:
 *          pHeader: Header containing the SBC parameters
 *
 * Return:
 *          Frame Length
 *
 * ***************************************************************************/
static uint16_t a2dp_sink_get_frame_len (uint8_t *pHeader)
{
    uint8_t *pframeByte0;
    uint8_t *pframeByte1;
    uint8_t *pframeByte2;
    uint8_t  blocks;
    uint8_t  channelMode;
    uint8_t  subbands;
    uint8_t  bitpool;
    uint8_t  num_channels;
    uint8_t  join;
    uint32_t FrameLen;
    uint32_t tmp;

    pframeByte0 = pHeader;
    FrameLen = 0;

    if (*pframeByte0 != SBC_SYNC_BYTE)
    {
        WICED_BT_TRACE ("a2dp_sink_get_frame_len(): Bad Sync Byte: 0x%02x !!!", *pframeByte0);
        return (0);
    }

    pframeByte1 = pframeByte0 + 1;
    pframeByte2 = pframeByte1 + 1;

    /* Derive the Number of blocks and, frequency,
     * channel mode according to the Frame Header */

    /* Table 12.12: Syntax of frame_header from Advanced Audio Distribution /
     * Profile Specification
     *
     * frame_header()
     * {
     *    syncword                8
     *    sampling_frequency      2
     *    blocks                  2
     *    channel_mode            2
     *    allocation_method       1
     *    subbands                1
     *    bitpool                 8
     *    crc_check               8
     *    If (channel_mode==JOINT_STEREO)
     *    {
     *       for (sb=0;sb<nrof_subbands-1;sb++)
     *       {
     *           join[sb] 1 UiMsbf
     *       }
     *       RFA 1 UiMsbf
     *    }
     * }
     */

    blocks = (*(unsigned char *)pframeByte1 & 0x30) >> 4;

    /* Check and assign the SBC equivalent block alignment */
    switch (blocks)
    {
    case 0x0:
        blocks = SBC_BLOCK_0;
        break;
    case 0x1:
        blocks = SBC_BLOCK_1;
        break;
    case 0x2:
        blocks = SBC_BLOCK_2;
        break;
    case 0x3:
        blocks = SBC_BLOCK_3;
        break;
    }
    channelMode    = (*(unsigned char *)pframeByte1 & 0x0C) >> 2;
    num_channels = (channelMode == SBC_MONO) ? SBC_DUAL : SBC_STEREO;

    subbands    = (*(unsigned char *)pframeByte1 & 0x01);
    subbands = (subbands == 0) ? SBC_SUB_BANDS_4 : SBC_SUB_BANDS_8;

    /* Refer to 12.9 Calculation of Bit Rate and Frame Length in
     * A2DP Specification A2DP_v1.3.2.pdf
     * for the formula and calculations
     */
    bitpool = (*(unsigned char *)pframeByte2 & 0xff);

    FrameLen = 4 + (4 * subbands * num_channels) / 8;

    join = (channelMode == CH_MODE_JOINT_STEREO) ? 1 : 0;

    if (channelMode < 2) /* channel Mode is not Join */
    {
        tmp =  (blocks * num_channels * bitpool);
    }
    else
    {
        tmp =  (join * subbands) + (blocks * bitpool);
    }

    FrameLen += tmp / 8 + ((tmp % 8) ? 1 : 0);

    return ((uint16_t)FrameLen);
}

/* ****************************************************************************
 * Function Name: a2dp_audio_decoder_init
 ******************************************************************************
 * Summary:
 *          Initializes the SBC Decoder
 *
 * Parameters:
 *          None
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
static void a2dp_audio_decoder_init()
{
    wiced_bt_a2dp_codec_info_t *codec_info = &av_app_cb.codec_config;

    WICED_BT_TRACE("a2dp_audio_decoder_init");

    memset (staticMem, 0, sizeof (staticMem));
    memset (scratchMem, 0, sizeof (scratchMem));
    memset (&strDecParams, 0, sizeof (strDecParams));

    /* Fill the Decoder parameters */
    strDecParams.s32StaticMem  = staticMem;
    strDecParams.s32ScratchMem = scratchMem;

    strDecParams.numOfBlocks = codec_info->cie.sbc.block_len;

    if ((codec_info->cie.sbc.ch_mode == A2D_SBC_IE_CH_MD_STEREO) ||
            (codec_info->cie.sbc.ch_mode == A2D_SBC_IE_CH_MD_JOINT))
    {
        strDecParams.numOfChannels = 2;
    }
    else
    {
        strDecParams.numOfChannels = 1;
    }

    if (codec_info->cie.sbc.num_subbands == A2D_SBC_IE_SUBBAND_4)
    {
        strDecParams.numOfSubBands = 4;
    }
    else if (codec_info->cie.sbc.num_subbands == A2D_SBC_IE_SUBBAND_8)
    {
        strDecParams.numOfSubBands = 8;
    }

    if (codec_info->cie.sbc.alloc_mthd == A2D_SBC_IE_ALLOC_MD_S)
    {
        strDecParams.allocationMethod = SBC_SNR;
    }
    else if (codec_info->cie.sbc.alloc_mthd == A2D_SBC_IE_ALLOC_MD_L)
    {
        strDecParams.allocationMethod = SBC_LOUDNESS;
    }

    if (codec_info->cie.sbc.samp_freq == A2D_SBC_IE_SAMP_FREQ_44)
    {
        sample_rate = AUDIO_SAMPLE_RATE_44_1kHz;
    }
    else if (codec_info->cie.sbc.samp_freq == A2D_SBC_IE_SAMP_FREQ_48)
    {
        sample_rate = AUDIO_SAMPLE_RATE_48kHz;
    }
    else
    {
        sample_rate = AUDIO_SAMPLE_RATE_32kHz;
    }


    SBC_Decoder_decode_Init (&strDecParams);

    WICED_BT_TRACE("nblocks %d nchannels %d nsubbands %d ameth %d freq %d",
                   strDecParams.numOfBlocks , strDecParams.numOfChannels,
                   strDecParams.numOfSubBands, strDecParams.allocationMethod,
                   sample_rate);

    PcmBytesPerFrame = strDecParams.numOfBlocks * strDecParams.numOfChannels *
                        strDecParams.numOfSubBands * 2;

    /* Calculate the audio frames to write */
    audio_frames_to_write = PcmBytesPerFrame / strDecParams.numOfChannels;
    audio_frames_to_write /= 2; /*Bits per sample is 16 */
}

/* ****************************************************************************
 * Function Name: a2dp_sink_control_cback
 ******************************************************************************
 * Summary:
 *          Control callback supplied by  the a2dp sink profile code.
 *
 * Parameters:
 *          event - control event called back
 *          p_data - event data
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
void a2dp_sink_control_cback( wiced_bt_a2dp_sink_event_t event,
                                     wiced_bt_a2dp_sink_event_data_t* p_data )
{
    WICED_BT_TRACE( "[%s] Event: (%d) %s state: (%d) %s\n\r", __FUNCTION__, event,
                    get_control_event_name(event),
                    av_app_cb.state, get_state_name(av_app_cb.state));

    switch(event)
    {
    case WICED_BT_A2DP_SINK_CODEC_CONFIG_EVT:
        /**< Codec config event, received when codec config for a streaming
         * session is updated */
        /* Maintain State */
        av_app_cb.state = AV_STATE_CONFIGURED;

        if (NULL == p_data)
        {
            WICED_BT_TRACE ("A2DP Sink Control Callback with event data pointer NULL \n");
            return;
        }
        /* Save the configuration to setup the decoder if necessary. */
        memcpy( &av_app_cb.codec_config, &p_data->codec_config.codec, sizeof( wiced_bt_a2dp_codec_info_t ) );

        /* Maintain State */
        av_app_cb.state = AV_STATE_CONFIGURED;

        /* Save the configuration to setup the decoder if necessary. */
        memcpy( &av_app_cb.codec_config, &p_data->codec_config.codec, sizeof( wiced_bt_a2dp_codec_info_t ) );

        WICED_BT_TRACE(" a2dp sink codec configuration done\n");
        a2dp_audio_decoder_init();

