Cosmic-Bee/PSoC6_Bluetooth_A2DP_Sink/source/sink_bluetooth/a2dp_sink.c
        WICED_BT_TRACE(" Now configuring Audio Driver...\n");
        is2_audio_init();

        break;

    case WICED_BT_A2DP_SINK_CONNECT_EVT:
        if (NULL == p_data)
        {
            WICED_BT_TRACE ("A2DP Sink Control Callback with event data pointer NULL \n");
            return;
        }
        /**< Connected event, received on establishing connection to a peer
         * device. Ready to stream. */
        if (p_data->connect.result == WICED_SUCCESS)
        {
            WICED_BT_TRACE( "[%s] connected to addr: <%B> Handle:%d\n\r", __FUNCTION__, p_data->connect.bd_addr,
                            p_data->connect.handle );

            /* Save the address of the remote device on remote connection */
            memcpy(av_app_cb.peerBda, p_data->connect.bd_addr, sizeof(wiced_bt_device_address_t));

            /* Maintain State */
            av_app_cb.state = AV_STATE_CONNECTED;

            WICED_BT_TRACE(" a2dp sink connected \n");
        }
        else
        {
            WICED_BT_TRACE("a2dp Connection failed \n");
        }
        break;

    case WICED_BT_A2DP_SINK_DISCONNECT_EVT:
        /**< Disconnected event, received on disconnection from a peer device */
        /* Maintain State */
        av_app_cb.state = AV_STATE_IDLE;
        WICED_BT_TRACE(" a2dp sink disconnected \n");
        i2s_audio_deinit();
        break;

    case WICED_BT_A2DP_SINK_START_IND_EVT:
        if (NULL == p_data)
        {
            WICED_BT_TRACE ("A2DP Sink Control Callback with event data pointer NULL \n");
            return;
        }
        /**< Start stream indication, Send response */
        WICED_BT_TRACE("  a2dp sink start indication from Peer @handle: %d, %x \n", p_data->start_ind.handle,
                       p_data->start_ind.label );
        if (!wiced_bt_a2dp_sink_send_start_response( p_data->start_ind.handle, p_data->start_ind.label,
                                                      A2D_SUCCESS))
        {
            /* Maintain State */
            av_app_cb.state = AV_STATE_STARTED;
            WICED_BT_TRACE(" a2dp sink streaming started \n");
        }
        break;

    case WICED_BT_A2DP_SINK_START_CFM_EVT:
        if (NULL == p_data)
        {
            WICED_BT_TRACE ("A2DP Sink Control Callback with event data pointer NULL \n");
            return;
        }
        /**< Start stream event, received when audio streaming is about to
         * start */
        /* Maintain State */
        av_app_cb.state = AV_STATE_STARTED;
        WICED_BT_TRACE(" a2dp sink streaming started handle:%d\n", p_data->start_cfm.handle);
        break;

    case WICED_BT_A2DP_SINK_SUSPEND_EVT:
        /**< Suspend stream event, received when audio streaming is
         * suspended */
        /* Maintain State */
        av_app_cb.state = AV_STATE_CONNECTED;
        WICED_BT_TRACE(" a2dp sink streaming suspended \n");
        break;

    default:
        break;
    }
}

/* ****************************************************************************
 * Function Name: a2dp_sink_data_cback
 ******************************************************************************
 * Summary:
 *          Data supplied by  the a2dp sink profile code.
 *
 * Parameters:
 *          p_a2dp_data   - A2DP media data
 *          a2dp_data_len - A2DP data length
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
void a2dp_sink_data_cback( uint8_t* p_rx_media, uint32_t media_len )
{
    int status = WICED_BT_SUCCESS;
    uint8_t         i = 0, num_frames = 0;
    uint16_t        frame_len = 0;
    uint16_t        *pOut = NULL;

    WICED_BT_TRACE("Received a2dp data len %d Num frames %d", media_len, (*p_rx_media & 0x0F));

    num_frames =  *p_rx_media & 0x0F;
    p_rx_media++;
    media_len--;

    for (i = 0; i < num_frames; i++)
    {
        /* Get frame length. stop if any error */
        if ((frame_len = a2dp_sink_get_frame_len (p_rx_media)) == 0)
        {
            break;
        }

        if (frame_len > media_len)
        {
            WICED_BT_TRACE ("a2dp_sink_proc_stream_data(): media too short %d %d %d %d", num_frames, i,
                            frame_len, media_len);
            break;
        }

        pOut = (uint16_t *) wiced_bt_get_buffer(PcmBytesPerFrame);

        if (pOut == NULL)
        {
            WICED_BT_TRACE ("a2dp_sink_proc_stream_data(): NO BUFFER !!!  ");
            break;
        }

        SBC_Decoder_decoder (&strDecParams, p_rx_media, frame_len, (SINT16 *)pOut);
        status = i2s_audio_data_write((void *)pOut, audio_frames_to_write,
                                           &audio_frames_written);
        if (status != WICED_BT_SUCCESS)
        {
           WICED_BT_TRACE ("i2s_audio_data_write () failed. Status: %d", status);
        }

        p_rx_media += frame_len;
        media_len  -= frame_len;
        wiced_bt_free_buffer(pOut);
    }
}

/******************************************************************************
 * Function Name: a2dp_sink_write_eir
 *******************************************************************************
 * Summary:
 *          Prepare extended inquiry response data.  Current version publishes
 *          audio sink services.
 *
 * Parameters:
 *          None
 *
 * Return:
 *          None
 *
 ******************************************************************************/
void a2dp_sink_write_eir( void )
{
    uint8_t *pBuf;
    uint8_t *p;
    uint8_t length;

    pBuf = (uint8_t*)wiced_bt_get_buffer( WICED_HS_EIR_BUF_MAX_SIZE );
    WICED_BT_TRACE( "a2dp_sink_write_eir %x\n", pBuf );

    if ( !pBuf )
    {
        return;
    }
    p = pBuf;

    length = strlen( (char *)a2dp_sink_cfg_settings.device_name );

    *p++ = length + 1;
    *p++ = BT_EIR_COMPLETE_LOCAL_NAME_TYPE;   /* EIR type full name */
    memcpy( p, a2dp_sink_cfg_settings.device_name, length );
    p += length;
    *p++ = ( 1 * 2 ) + 1;     /* length of services + 1 */
    *p++ =   BT_EIR_COMPLETE_16BITS_UUID_TYPE;
    /* EIR type full list of 16 bit service UUIDs */
    *p++ =   UUID_SERVCLASS_AUDIO_SINK        & 0xff;
    *p++ = ( UUID_SERVCLASS_AUDIO_SINK >> 8 ) & 0xff;
    *p++ = 0;

    /* print EIR data */
    WICED_BT_TRACE_ARRAY( ( uint8_t* )( pBuf+1 ), MIN( p-( uint8_t* )pBuf,100 ), "EIR :" );
    wiced_bt_dev_write_eir( pBuf, (uint16_t)(p - pBuf) );
}

