Cosmic-Bee/PSoC6_Bluetooth_A2DP_Sink/source/sink_bluetooth/a2dp_sink.c
/******************************************************************************
 * Function Name: a2dp_sink_write_nvram
 *******************************************************************************
 * Summary:
 *          Write NVRAM function is called to store information but in PSoC6 it will not be stored.
 *
 * Parameters:
 *          nvram_id: NVRAM Id
 *          data_len: Length of the data to be written
 *          p_data: Data to be written
 *
 * Return:
 *          Number of bytes written
 *
 *****************************************************************************/
uint16_t a2dp_sink_write_nvram( int nvram_id, int data_len, void *p_data)
{
    uint16_t        bytes_written = 0;

    if (p_data != NULL)
    {
        bytes_written=data_len;
        memcpy(&nv_key_ram,p_data,sizeof(wiced_bt_device_link_keys_t));
        WICED_BT_TRACE("NVRAM ID:%d written :%d bytes \n", nvram_id, bytes_written);
    }

    return (bytes_written);
}


/******************************************************************************
 * Function Name: a2dp_sink_read_nvram
 *******************************************************************************
 * Summary:
 *          Read data from the NVRAM and return in the passed buffer
 *
 * Parameters:
 *          nvram_id: NVRAM Id
 *          data_len: Length of the data to be read
 *          p_data: Data buffer pointer to hold read data
 *
 * Return:
 *          Number of bytes read
 *
 *****************************************************************************/
uint16_t a2dp_sink_read_nvram( int nvram_id, void *p_data, int data_len)
{
    uint16_t        read_bytes = 0;

    if ((p_data != NULL) && (data_len >= sizeof(wiced_bt_device_link_keys_t)))
    {
        memset(&nv_key_ram,0xFF,sizeof(wiced_bt_device_link_keys_t));
        WICED_BT_TRACE("NVRAM ID:%d read out of %d bytes:%d \n", nvram_id,
                       sizeof(wiced_bt_device_link_keys_t), read_bytes );
    }
    return (read_bytes);
}


/******************************************************************************
 * Function Name: a2dp_sink_app_init()
 *******************************************************************************
 * Summary:
 *   This function handles application level initialization tasks and is
 *   called from the BT management callback once the Bluetooth stack enabled
 *   event (BTM_ENABLED_EVT) is triggered
 *   This function is executed in the BTM_ENABLED_EVT management callback.
 *
 * Parameters:
 *   None
 *
 * Return:
 *   None
 *
 ******************************************************************************/
void a2dp_sink_app_init( void )
{
    wiced_result_t result = WICED_BT_SUCCESS;
    av_app_cb.state = AV_STATE_IDLE;

    /* Register with the A2DP sink profile code */
    result = wiced_bt_a2dp_sink_init( &bt_audio_config,
                                         a2dp_sink_control_cback );
    if (result == WICED_BT_SUCCESS)
    {
        wiced_bt_a2dp_sink_register_data_cback(a2dp_sink_data_cback);
    }
}

/******************************************************************************
 * Function Name: a2dp_sink_management_callback()
 *******************************************************************************
 * Summary:
 *   This is a Bluetooth stack event handler function to receive management
 *   events from the Bluetooth stack and process as per the application.
 *
 * Parameters:
 *   wiced_bt_management_evt_t event : BLE event code of one byte length
 *   wiced_bt_management_evt_data_t *p_event_data: Pointer to BLE management
 *   event structures
 *
 * Return:
 *  wiced_result_t: Error code from WICED_RESULT_LIST or BT_RESULT_LIST
 *
 ******************************************************************************/

wiced_result_t a2dp_sink_management_callback( wiced_bt_management_evt_t event,
                                              wiced_bt_management_evt_data_t *p_event_data )
{
    wiced_bt_ble_advert_mode_t          *p_mode; /* Advertisement Mode */
    uint8_t                             *p_keys; /* Paired event Link keys */
    wiced_bt_device_address_t           bda = {0};
    wiced_result_t                      result = WICED_BT_SUCCESS;

    wiced_bt_power_mgmt_notification_t *p_power_mgmt_notification;
    wiced_bt_dev_encryption_status_t   *p_encryption_status;
    wiced_bt_dev_pairing_cplt_t        *p_pairing_cmpl;
    int                                 pairing_result;
    const uint8_t                      *link_key;

    WICED_BT_TRACE( "A2dp sink management callback: %x\n", event );

    switch( event )
    {
        /* Bluetooth  stack enabled */
    case BTM_ENABLED_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        if (WICED_BT_SUCCESS == p_event_data->enabled.status)
        {
            /* Bluetooth is enabled */
            wiced_bt_set_local_bdaddr((uint8_t *)bt_device_address, BLE_ADDR_PUBLIC);
            wiced_bt_dev_read_local_addr(bda);
            WICED_BT_TRACE("Bluetooth Enabled \n");
            WICED_BT_TRACE("Local Bluetooth Address: %02X:%02X:%02X:%02X:%02X:%02X\n", bda[0], bda[1], bda[2],
                    bda[3], bda[4], bda[5] );

            /* Enable pairing */
            wiced_bt_set_pairable_mode(WICED_TRUE, 0);

            a2dp_sink_write_eir();

            /* create SDP records */
            wiced_bt_sdp_db_init((uint8_t*) a2dp_sink_sdp_db,
                sizeof(a2dp_sink_sdp_db));

           /* start the a2dp application */
           a2dp_sink_app_init();

           /* Making the sink device discoverable and connectable */
           wiced_bt_dev_set_discoverability(BTM_GENERAL_DISCOVERABLE,
                BTM_DEFAULT_DISC_WINDOW, BTM_DEFAULT_DISC_INTERVAL);
           wiced_bt_dev_set_connectability(WICED_TRUE, BTM_DEFAULT_CONN_WINDOW,
                BTM_DEFAULT_CONN_INTERVAL);
        }
        else
        {
            WICED_BT_TRACE("Bluetooth Enable failed \n");
        }
        break;

