Cosmic-Bee/PSoC6_Bluetooth_A2DP_Sink/source/sink_bluetooth/a2dp_sink.c
    case BTM_DISABLED_EVT:
        WICED_BT_TRACE("Bluetooth Disabled \n");
        break;

    case BTM_PIN_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        WICED_BT_TRACE("remote address= ");
        print_bd_address(*p_event_data->pin_request.bd_addr);

        wiced_bt_dev_pin_code_reply(*p_event_data->pin_request.bd_addr,
                result/*WICED_BT_SUCCESS*/, 4, &pincode[0]);
        break;

    case BTM_USER_CONFIRMATION_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        WICED_BT_TRACE("Numeric_value: %d \n",
                p_event_data->user_confirmation_request.numeric_value);
        wiced_bt_dev_confirm_req_reply(WICED_BT_SUCCESS,
                p_event_data->user_confirmation_request.bd_addr);
        break;

    case BTM_PASSKEY_NOTIFICATION_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        WICED_BT_TRACE("PassKey Notification. BDA: ");
        print_bd_address(p_event_data->user_passkey_notification.bd_addr);
        WICED_BT_TRACE("PassKey Notification.  Key %d \n",
                p_event_data->user_passkey_notification.passkey);
        wiced_bt_dev_confirm_req_reply(WICED_BT_SUCCESS,
                p_event_data->user_passkey_notification.bd_addr);
        break;

    case BTM_PAIRING_IO_CAPABILITIES_BR_EDR_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* Use the default security for BR/EDR*/
        WICED_BT_TRACE("Pairing Capabilities Request, bda %B\n",
                p_event_data->pairing_io_capabilities_br_edr_request.bd_addr);
        p_event_data->pairing_io_capabilities_br_edr_request.local_io_cap =
                BTM_IO_CAPABILITIES_NONE;
        p_event_data->pairing_io_capabilities_br_edr_request.auth_req =
                BTM_AUTH_SINGLE_PROFILE_GENERAL_BONDING_NO;
        break;

    case BTM_PAIRING_IO_CAPABILITIES_BLE_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        p_event_data->pairing_io_capabilities_ble_request.local_io_cap      =
                BTM_IO_CAPABILITIES_NONE;
        p_event_data->pairing_io_capabilities_ble_request.oob_data          =
                BTM_OOB_NONE;
        p_event_data->pairing_io_capabilities_ble_request.auth_req          =
                BTM_LE_AUTH_REQ_SC_BOND;
        p_event_data->pairing_io_capabilities_ble_request.max_key_size      =
                0x10;
        p_event_data->pairing_io_capabilities_ble_request.init_keys         =
                BTM_LE_KEY_PENC|BTM_LE_KEY_PID|BTM_LE_KEY_PCSRK|BTM_LE_KEY_LENC;
        p_event_data->pairing_io_capabilities_ble_request.resp_keys         =
                BTM_LE_KEY_PENC|BTM_LE_KEY_PID|BTM_LE_KEY_PCSRK|BTM_LE_KEY_LENC;
        break;

    case BTM_PAIRING_COMPLETE_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        p_pairing_cmpl = &p_event_data->pairing_complete;

        if( p_pairing_cmpl->transport == BT_TRANSPORT_BR_EDR )
        {
            pairing_result = p_pairing_cmpl->pairing_complete_info.br_edr.status;
        }
        else
        {
            pairing_result = p_pairing_cmpl->pairing_complete_info.ble.status;
        }
        WICED_BT_TRACE("Pairing complete %d \n",pairing_result );
        break;

    case BTM_PAIRED_DEVICE_LINK_KEYS_UPDATE_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* save keys to NVRAM */
        p_keys = (uint8_t*)&p_event_data->paired_device_link_keys_update;

        /* This application supports a single paired host, we can save keys
         * under the same NVRAM ID overwriting previous pairing if any */
        a2dp_sink_write_nvram(A2DP_SINK_NVRAM_ID,
                sizeof(wiced_bt_device_link_keys_t), p_keys);
        link_key =
                p_event_data->paired_device_link_keys_update.key_data.br_edr_key;
        WICED_BT_TRACE(
                " LinkKey:%02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X\n",
                link_key[0], link_key[1], link_key[2], link_key[3], link_key[4],
                link_key[5], link_key[6], link_key[7], link_key[8], link_key[9],
                link_key[10], link_key[11], link_key[12], link_key[13],
                link_key[14], link_key[15]);
        break;

    case  BTM_PAIRED_DEVICE_LINK_KEYS_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* read existing key from the NVRAM  */
        if (a2dp_sink_read_nvram(A2DP_SINK_NVRAM_ID,
                &p_event_data->paired_device_link_keys_request,
                sizeof(wiced_bt_device_link_keys_t)) != 0)
        {
            result = WICED_BT_SUCCESS;
        }
        else
        {
            result = WICED_BT_ERROR;
            WICED_BT_TRACE("Key retrieval failure\n");
        }
        break;

    case BTM_POWER_MANAGEMENT_STATUS_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        p_power_mgmt_notification = &p_event_data->power_mgmt_notification;
        WICED_BT_TRACE(
                "Power mgmt status event: bd ( %B ) status:%d hci_status:%d\n",
                p_power_mgmt_notification->bd_addr,
                p_power_mgmt_notification->status,
                p_power_mgmt_notification->hci_status);
        break;

    case BTM_LOCAL_IDENTITY_KEYS_UPDATE_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* save keys to NVRAM */
        p_keys = (uint8_t*) &p_event_data->local_identity_keys_update;

        a2dp_sink_write_nvram(A2DP_SINK_NVRAM_ID,
                sizeof(wiced_bt_device_link_keys_t), &p_keys);
        WICED_BT_TRACE("local keys save to NVRAM ");
        break;

    case BTM_LOCAL_IDENTITY_KEYS_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* read keys from NVRAM */
        p_keys = (uint8_t*) &p_event_data->local_identity_keys_request;
        if (a2dp_sink_read_nvram (A2DP_SINK_NVRAM_ID,
                  &p_keys,
                  sizeof(wiced_bt_device_link_keys_t)) != 0)
        {
            result = WICED_BT_SUCCESS;
        }
        else
        {
            result = WICED_BT_ERROR;
            WICED_BT_TRACE ("Key retrieval failure\n");
        }
        WICED_BT_TRACE("local keys read from NVRAM ");
        WICED_BT_TRACE("  result: %d \n", result);
        break;

    case BTM_ENCRYPTION_STATUS_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        p_encryption_status = &p_event_data->encryption_status;
        WICED_BT_TRACE( "Encryption Status Event:  res %d", p_encryption_status->result);
        break;

    case BTM_SECURITY_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        wiced_bt_ble_security_grant(p_event_data->security_request.bd_addr,
                WICED_BT_SUCCESS);
        break;

    case BTM_BLE_ADVERT_STATE_CHANGED_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        p_mode = &p_event_data->ble_advert_state_changed;
        WICED_BT_TRACE( "Advertisement State Change: %d\n", *p_mode);
        break;

    case BTM_BLE_CONNECTION_PARAM_UPDATE:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* Connection parameters updated */
        if (WICED_SUCCESS == p_event_data->ble_connection_param_update.status) {
            WICED_BT_TRACE("Supervision Time Out = %d\n",
                    (p_event_data->ble_connection_param_update.supervision_timeout
                            * 10));
        }
        break;

    default:
        WICED_BT_TRACE("Unhandled Bluetooth Management Event: 0x%x %s\n", event,
        get_bt_event_name(event));
        break;
    }

    return result;
}
/* [] END OF FILE */
